package itProger.Threads;
//Создайте программу, что будет запрашивать у пользователя данные: имя, логин, возраст и список его хобби.
// Все эти значения получайте через класс Scanner.
//
//Будьте внимательны: крайний вызов метода «nextLine» обычно не срабатывает. Так происходит по причине,
// что Java засчитывает предыдущий символ как значение для крайнего вызова «nextLine». Для устранения проблемы
// пропишите два раза получение данных из «nextLine».
//
//После ввода всех данных выполните сериализацию. Позже пропишите код для выполнения десиреализации.
//
//Объект, что будет получен при десериализации должен быть выведен с использованием переопределенния метода toString().
//Список хобби выводится каждый раз с новой строки. Чтобы реализовать такое посмотрите на метод split. Он позволяет
// разделить строку по символу и далее получить массив элементов. В таком массиве каждый элемент можно будет вывести с новой строки.

public class Task_3 {

}
